html/p16-13-13-nom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>演習問題と解答(16) - 乃村研Haskell勉強会2012</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="演習問題と解答(16) - 乃村研Haskell勉強会2012"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-25"/>
<meta name="author" content="乃村 能成"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="pub/css/text.css">


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">演習問題と解答(16) - 乃村研Haskell勉強会2012</h1>


<div id="table-of-contents">
<h2>目次</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">演習問題と解答(08)</a>
<ul>
<li><a href="#sec-1-1">出題範囲</a></li>
<li><a href="#sec-1-2">問題</a>
<ul>
<li><a href="#sec-1-2-1">問題1</a></li>
<li><a href="#sec-1-2-2">問題2</a></li>
</ul>
</li>
<li><a href="#sec-1-3">解答例</a>
<ul>
<li><a href="#sec-1-3-1">解答1</a></li>
<li><a href="#sec-1-3-2">解答2</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">演習問題と解答(08)</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">出題範囲</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>13章 Writer? I hardly know her!  から
</li>
<li>13章 Error error on the wall まで
</li>
</ul>


<p>
    <a href="t16-13-13-nom.html">輪講資料</a>へ
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">問題</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">問題1</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>      以下の例は， <code>Writer</code> について <code>do</code> 表記を用いて，2つの値のかけ算を求めている．
      これを lambda 表記( <code>-&gt;</code> の入れ子形式)で展開せよ 
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Control.Monad.Writer</span>

<span style="color: #0000ff;">logNumber</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Int</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Writer</span> [<span style="color: #228b22;">String</span>] <span style="color: #228b22;">Int</span>
<span style="color: #0000ff;">logNumber</span> x <span style="color: #a0522d;">=</span> writer (x, [<span style="color: #8b2252;">"Got number: "</span> <span style="color: #a0522d;">++</span> show x])

<span style="color: #0000ff;">multWithLog</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Writer</span> [<span style="color: #228b22;">String</span>] <span style="color: #228b22;">Int</span>
<span style="color: #0000ff;">multWithLog</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
    a <span style="color: #a0522d;">&lt;-</span> logNumber 3
    b <span style="color: #a0522d;">&lt;-</span> logNumber 5
    return (a<span style="color: #a0522d;">*</span>b)
</pre>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">問題2</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>      <code>Maybe</code> モナドの学習時に綱渡り中にバランス棒に鳥が乗る話があった．
</p>



<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Control.Monad.Error</span>

<span style="color: #7f007f;">type</span> <span style="color: #228b22;">Birds</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Int</span>
<span style="color: #7f007f;">type</span> <span style="color: #228b22;">Pole</span> <span style="color: #a0522d;">=</span> (<span style="color: #228b22;">Birds</span>,<span style="color: #228b22;">Birds</span>)

<span style="color: #0000ff;">landLeft</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Birds</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Pole</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Maybe</span> <span style="color: #228b22;">Pole</span>
<span style="color: #0000ff;">landLeft</span> n (left,right)
    <span style="color: #a0522d;">|</span> abs ((left <span style="color: #a0522d;">+</span> n) <span style="color: #a0522d;">-</span> right) <span style="color: #a0522d;">&lt;</span> 4 <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Just</span> (left <span style="color: #a0522d;">+</span> n, right)
    <span style="color: #a0522d;">|</span> otherwise                    <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Nothing</span>

<span style="color: #0000ff;">landRight</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Birds</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Pole</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Maybe</span> <span style="color: #228b22;">Pole</span>
<span style="color: #0000ff;">landRight</span> n (left,right)
    <span style="color: #a0522d;">|</span> abs (left <span style="color: #a0522d;">-</span> (right <span style="color: #a0522d;">+</span> n)) <span style="color: #a0522d;">&lt;</span> 4 <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Just</span> (left, right <span style="color: #a0522d;">+</span> n)
    <span style="color: #a0522d;">|</span> otherwise <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Nothing</span>

<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">IO</span> <span style="color: #228b22;">()</span>
<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  print <span style="color: #a0522d;">$</span> return (0,0) <span style="color: #a0522d;">&gt;&gt;=</span> landRight 2 <span style="color: #a0522d;">&gt;&gt;=</span> landLeft 2 <span style="color: #a0522d;">&gt;&gt;=</span> landRight 2  
  print <span style="color: #a0522d;">$</span> return (0,0) <span style="color: #a0522d;">&gt;&gt;=</span> landLeft 1 <span style="color: #a0522d;">&gt;&gt;=</span> landRight 4 <span style="color: #a0522d;">&gt;&gt;=</span> landLeft (<span style="color: #a0522d;">-</span>1) <span style="color: #a0522d;">&gt;&gt;=</span> landRight (<span style="color: #a0522d;">-</span>2) 
</pre>


<p>
      実行結果:
</p><pre class="example">
Just (2,4)
Nothing
</pre>


<p>
      これを <code>Either</code> で実現し，綱渡りが失敗したときに，
      棒の左右に載っていた鳥の数が分かるようにせよ．
</p>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">解答例</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">解答1</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Control.Monad.Writer</span>

<span style="color: #0000ff;">logNumber</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Int</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Writer</span> [<span style="color: #228b22;">String</span>] <span style="color: #228b22;">Int</span>
<span style="color: #0000ff;">logNumber</span> x <span style="color: #a0522d;">=</span> writer (x, [<span style="color: #8b2252;">"Got number: "</span> <span style="color: #a0522d;">++</span> show x])

<span style="color: #0000ff;">multWithLog</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Writer</span> [<span style="color: #228b22;">String</span>] <span style="color: #228b22;">Int</span>
<span style="color: #0000ff;">multWithLog</span> <span style="color: #a0522d;">=</span> logNumber 3 <span style="color: #a0522d;">&gt;&gt;=</span> (<span style="color: #a0522d;">\</span>a <span style="color: #a0522d;">-&gt;</span>
              logNumber 5 <span style="color: #a0522d;">&gt;&gt;=</span> (<span style="color: #a0522d;">\</span>b <span style="color: #a0522d;">-&gt;</span>
              return (a<span style="color: #a0522d;">*</span>b)))

<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  print <span style="color: #a0522d;">$</span> runWriter multWithLog
</pre>


<p>
     実行結果:
</p><pre class="example">
(15,["Got number: 3","Got number: 5"])
</pre>


<p>
     ここで，
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t (<span style="color: #a0522d;">&gt;&gt;=</span>)
(<span style="color: #0000ff;">&gt;&gt;=</span>) <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Monad</span> m <span style="color: #a0522d;">=&gt;</span> m a <span style="color: #a0522d;">-&gt;</span> (a <span style="color: #a0522d;">-&gt;</span> m b) <span style="color: #a0522d;">-&gt;</span> m b

ghci<span style="color: #0000ff;">&gt;</span> runWriter (return 15 <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Writer</span> [<span style="color: #228b22;">String</span>] <span style="color: #228b22;">Int</span>)
(15,<span style="color: #228b22;">[]</span>)
</pre>

<p>
     であることに注意．
</p>
</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">解答2</h4>
<div class="outline-text-4" id="text-1-3-2">




<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Control.Monad.Error</span>

<span style="color: #7f007f;">type</span> <span style="color: #228b22;">Birds</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Int</span>
<span style="color: #7f007f;">type</span> <span style="color: #228b22;">Pole</span> <span style="color: #a0522d;">=</span> (<span style="color: #228b22;">Birds</span>,<span style="color: #228b22;">Birds</span>)

<span style="color: #0000ff;">landLeftE</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Birds</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Pole</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Either</span> <span style="color: #228b22;">String</span> <span style="color: #228b22;">Pole</span>
<span style="color: #0000ff;">landLeftE</span> n (left,right)
    <span style="color: #a0522d;">|</span> abs ((left <span style="color: #a0522d;">+</span> n) <span style="color: #a0522d;">-</span> right) <span style="color: #a0522d;">&lt;</span> 4 <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Right</span> (left <span style="color: #a0522d;">+</span> n, right)
    <span style="color: #a0522d;">|</span> otherwise                    <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Left</span> <span style="color: #a0522d;">$</span> show (left <span style="color: #a0522d;">+</span> n, right)

<span style="color: #0000ff;">landRightE</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Birds</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Pole</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Either</span> <span style="color: #228b22;">String</span> <span style="color: #228b22;">Pole</span>
<span style="color: #0000ff;">landRightE</span> n (left,right)
    <span style="color: #a0522d;">|</span> abs (left <span style="color: #a0522d;">-</span> (right <span style="color: #a0522d;">+</span> n)) <span style="color: #a0522d;">&lt;</span> 4 <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Right</span> (left, right <span style="color: #a0522d;">+</span> n)
    <span style="color: #a0522d;">|</span> otherwise                    <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Left</span>  <span style="color: #a0522d;">$</span> show (left, right <span style="color: #a0522d;">+</span> n)

<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">IO</span> <span style="color: #228b22;">()</span>
<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  print <span style="color: #a0522d;">$</span> return (0,0) <span style="color: #a0522d;">&gt;&gt;=</span> landRightE 2 <span style="color: #a0522d;">&gt;&gt;=</span> landLeftE 2 <span style="color: #a0522d;">&gt;&gt;=</span> landRightE 2
  print <span style="color: #a0522d;">$</span> return (0,0) <span style="color: #a0522d;">&gt;&gt;=</span> landLeftE 1 <span style="color: #a0522d;">&gt;&gt;=</span> landRightE 4 <span style="color: #a0522d;">&gt;&gt;=</span> landLeftE (<span style="color: #a0522d;">-</span>1) <span style="color: #a0522d;">&gt;&gt;=</span> landRightE (<span style="color: #a0522d;">-</span>2) 
</pre>


<p>
      実行結果:
</p><pre class="example">
Right (2,4)
Left "(0,4)"
</pre>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-25</p>
<p class="author">Author: 乃村 能成</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.8.11 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>


</div>
</body>
</html>
